{
    "welcome": "Welcome to our app!",
    "home": "Home",
    "aboutMe": "About me",
    "contact": "Contact",
    "name": "Jose Martínez",
    "proffesion": "Web Developer",
    "contactMe": "Contact Me",
    "experienceOne": "I developed a login system for an in-house CMS using React.js on the frontend and Python on the backend. I also implemented SOLID, Clean Code and Software Architecture principles. I added services like Redux, Redux Toolkit, SQLAlchemy and used Digital Ocean and Docker. I applied Singleton design patterns and took into account the SOLID principle of Single Responsibility. In addition, I created a server-side application with Python using FastAPI and used Git and Github for version control.",
    "experienceTwo": "In charge of the development of the main Landing Page of the stock exchange using Vue.js. In addition, I applied principles such as SOLID, Clean Code and Software Architecture. I added additional services such as i18N, Vuex, TailwindCSS and SAS. I implemented Singleton design patterns and took care of the UX/UI design. I also worked on the login system and frontend admin development. I used Git and Github for version control.",
    "experienceThree": "I was responsible for developing the main application and the administrator using Vue.js. Applying principles such as SOLID, Clean Code and Software Architecture, I managed to create efficient solutions. In addition, I added additional services such as Vuex, TailwindCSS, SASS, among others. I implemented Singleton design patterns and took care of specific server-side tasks using Node.js, Express.js and MongoDB. I used Git and Github as a version controller. This experience allowed me to acquire technical skills and work on large projects.",
    "experienceFour": "As a Front End developer in React.js, I have worked in different Fintech projects, where I have been in charge of the maintenance and creation of new features. During my experience, I have performed the migration from Class Components to Functional Components using hooks. In addition, I have used services such as Redux, Redux Toolkit, Redux Thunk, SASS, StyleSheet Component and i18n. I apply design patterns and principles such as SOLID, Clean Code and Software Architecture. I also have experience using tools such as SCREM (Bitbucket, Confluence, JIRA, among others). My goal has always been to develop quality applications, following best practices and using modern technologies.",
    "softwareDeveloper": "Software Developer",
    "initExplication": "I am a Software Developer with knowledge and experience in:",
    "endExplication": "I have skills in the creation and maintenance of websites and web applications, as well as in the implementation of designs and functionalities. I adapt quickly to new technologies and have a focus on design and usability. I am committed to code quality and team collaboration.",
    "frontEndDeveloper": "Frontend Developer",
    "frebuary": "Frebuary",
    "november": "November",
    "april": "April",
    "juny": "Juny",
    "present": "Present",
    "changeViewExperience": "See experience",
    "changeViewTech": "See Skill",
    "nameInput": "Name",
    "email": "Email",
    "subject": "Subject",
    "message": "Message",
    "send": "Send",
    "placeHolderName": "Enter your name",
    "placeHolderEmail": "Enter your email",
    "placeHolderSubject": " Enter a subject",
    "placeHolderMessage": "Enter your message",
    "requiredField": "Required field"
}