{
    "welcome": "¡Bienvenido a nuestra aplicación!",
    "home": "Inicio",
    "aboutMe": "Sobre mi",
    "contact": "Contacto",
    "name": "Jose Martínez",
    "proffesion": "Desarrollador Web",
    "contactMe": "Contáctame",
    "experienceOne": "Desarrollé un sistema de login para un CMS en la empresa utilizando React.js en el frontend y Python en el backend. También implementé principios SOLID, Clean Code y Arquitectura de Software. Agregué servicios como Redux, Redux Toolkit, SQLAlchemy y utilicé Digital Ocean y Docker. Apliqué patrones de diseño Singleton y tuve en cuenta el principio SOLID de Responsabilidad Única. Además, creé una aplicación del lado del servidor con Python utilizando FastAPI y utilicé Git y Github para el control de versiones.",
    "experienceTwo": "Encargado del desarrollo de la Landing Page principal de la bolsa utilizando Vue.js. Además, apliqué principios como SOLID, Clean Code y Arquitectura de Software. Agregué servicios adicionales como i18N, Vuex, TailwindCSS y SAS. Implementé patrones de diseño Singleton y me encargué del diseño UX/UI. También trabajé en el sistema de login y en el desarrollo del administrador en el frontend. Utilicé Git y Github para el control de versiones.",
    "experienceThree": "tuve la responsabilidad de desarrollar la aplicación principal y el administrador utilizando Vue.js. Aplicando principios como SOLID, Clean Code y Arquitectura de Software, logré crear soluciones eficientes. Además, agregué servicios adicionales como Vuex, TailwindCSS, SASS, entre otros. Implementé patrones de diseño Singleton y me encargué de tareas específicas del lado del servidor utilizando Node.js, Express.js y MongoDB. Utilicé Git y Github como controlador de versiones. Esta experiencia me permitió adquirir habilidades técnicas y trabajar en proyectos de gran envergadura.",
    "experienceFour": "Como desarrollador Front End en React.js, he trabajado en distintos proyectos de Fintech, donde me he encargado del mantenimiento y creación de nuevas características. Durante mi experiencia, he realizado la migración de Class Components a Functional Components utilizando hooks. Además, he utilizado servicios como Redux, Redux Toolkit, Redux Thunk, SASS, StyleSheet Component e i18n. Aplico patrones de diseño y principios como SOLID, Clean Code y Arquitectura de Software. También tengo experiencia en el uso de herramientas como SCREM (Bitbucket, Confluence, JIRA, entre otros). Mi objetivo siempre ha sido desarrollar aplicaciones de calidad, siguiendo las mejores prácticas y utilizando tecnologías modernas.",
    "softwareDeveloper": "Desarrollador de Software",
    "initExplication": "Soy Desarrollador de Software con conocimientos y experiencia en:",
    "endExplication": "Tengo habilidades en la creación y el mantenimiento de sitios web y aplicaciones web, así como en la implementación de diseños y funcionalidades. Me adapto rápidamente a nuevas tecnologías y tengo un enfoque en el diseño y la usabilidad. Estoy comprometido con la calidad del código y la colaboración en equipo.",
    "frontEndDeveloper": "Desarrollador Frontend",
    "frebuary": "Febrero",
    "november": "Noviembre",
    "april": "Abril",
    "juny": "Junio",
    "present": "Presente",
    "changeViewExperience": "Ver Experiencia",
    "changeViewTech": "Ver Habilidades",
    "nameInput": "Nombre",
    "email": "Correo",
    "subject": "Asunto",
    "message": "Mensaje",
    "send": "Enviar",
    "placeHolderName": "Ingrese su nombre",
    "placeHolderEmail": "Ingrese su correo electrónico",
    "placeHolderSubject": "Ingrese un asunto",
    "placeHolderMessage": "Ingrese el mensaje a enviar",
    "requiredField": "Campo requerido"
}